package cn.lz.data.provider.util;

import java.util.Random;

/**
 * @Author zhanglei
 * @Date 2023/12/21 14:42
 * @Desc 用于生成随机数工具类
 */
public class RandomUtil {

    static String familyName1 = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻水云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳鲍史唐费岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅卞齐康伍余元卜顾孟平"
            + "黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计成戴宋茅庞熊纪舒屈项祝董粱杜阮席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田胡凌霍万柯卢莫房缪干解应宗丁宣邓郁单杭洪包诸左石崔吉"
            + "龚程邢滑裴陆荣翁荀羊甄家封芮储靳邴松井富乌焦巴弓牧隗山谷车侯伊宁仇祖武符刘景詹束龙叶幸司韶黎乔苍双闻莘劳逄姬冉宰桂牛寿通边燕冀尚农温庄晏瞿茹习鱼容向古戈终居衡步都耿满弘国文东殴沃曾关红游盖益桓公晋楚闫";
    static String familyName2 = "欧阳太史端木上官司马东方独孤南宫万俟闻人夏侯诸葛尉迟公羊赫连澹台皇甫宗政濮阳公冶太叔申屠公孙慕容仲孙钟离长孙宇文司徒鲜于司空闾丘子车亓官司寇巫马公西颛孙壤驷公良漆雕乐正宰父谷梁拓跋夹谷轩辕令狐段干百里呼延东郭南门羊舌微生公户公玉公仪梁丘公仲公上公门公山公坚左丘公伯西门公祖第五公乘贯丘公皙南荣东里东宫仲长子书子桑即墨达奚褚师吴铭";
    static String girlName = "秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽";
    static String boyName = "伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾楠榕风航弘";

    //共计90个专业类
    static String[] majorArray = {"哲学类","经济学类","财政学类","金融学类","经济与贸易类","法学类","政治学类","社会学类","民族学类","马克思主义理论类","公安学类","教育学类","体育学类","中国语言文学类","外国语言文学类","新闻传播学类","历史学类","数学类","物理学类","化学类","天文学类","地理科学类","大气科学类","海洋科学类","地球物理学类","地质学类","生物科学类","心理学类","统计学类","力学类","机械类","仪器类","材料类","能源动力类","电气类","电子信息类","自动化类","计算机类","土木类","水利类","测绘类","化工与制药类","地质类","矿业类","纺织类","轻工类","交通运输类","海洋工程类","航空航天类","兵器类","核工程类","农业工程类","林业工程类","环境科学与工程类","生物医学工程类","食品科学与工程类","建筑类","安全科学与工程类","生物工程类","公安技术类","植物生产类","自然保护与环境生态类","动物生产类","林学类","水产类","基础医学类","临床医学类","口腔医学类","公共卫生与预防医学类","中医学类","中西医结合类","药学类","中药学类","法医学类","医学技术类","护理学类","管理科学与工程类","工商管理类","农业经济管理类","公共管理类","图书情报与档案管理类","物流管理与工程类","工业工程类","电子商务类","旅游管理类","艺术学理论类","音乐与舞蹈学类","戏剧与影视学类","美术学类","设计学类"};

    //目前共197个国家
    static String[] countryArray = {"中国","蒙古","朝鲜","韩国","日本","菲律宾","越南","老挝","柬埔寨","缅甸","泰国","马来西亚","文莱","新加坡","印度尼西亚","东帝汶","尼泊尔","不丹","孟加拉国","印度","巴基斯坦","斯里兰卡","马尔代夫","哈萨克斯坦","吉尔吉斯斯坦","塔吉克斯坦","乌兹别克斯坦","土库曼斯坦","阿富汗","伊拉克","伊朗","叙利亚","约旦","黎巴嫩","以色列","巴勒斯坦","沙特阿拉伯","巴林","卡塔尔","科威特","阿拉伯联合酋长国","阿曼","也门","格鲁吉亚","亚美尼亚","阿塞拜疆","土耳其","塞浦路斯","芬兰","瑞典","挪威","冰岛","丹麦 ","爱沙尼亚","拉脱维亚","立陶宛","摩尔多瓦","白俄罗斯","俄罗斯","乌克兰","波兰","捷克","斯洛伐克","匈牙利","德国","奥地利","瑞士","列支敦士登","英国","爱尔兰","荷兰","比利时","卢森堡","法国","摩纳哥","罗马尼亚","保加利亚","塞尔维亚","北马其顿","斯洛文尼亚","克罗地亚","黑山","波斯尼亚和黑塞哥维那","阿尔巴尼亚","希腊","意大利","马耳他","梵蒂冈","圣马力诺","西班牙","葡萄牙","安道尔","埃及","利比亚","突尼斯","阿尔及利亚","摩洛哥","苏丹","南苏丹","埃塞俄比亚","厄立特里亚","索马里","吉布提","肯尼亚","坦桑尼亚","乌干达","卢旺达","布隆迪","塞舌尔","乍得","中非","喀麦隆","赤道几内亚","加蓬","刚果共和国","刚果民主共和国","圣多美和普林西比","毛里塔尼亚","塞内加尔","冈比亚","马里","布基纳法索","几内亚","几内亚比绍","佛得角","塞拉利昂","利比里亚","科特迪瓦","加纳","多哥","贝宁","尼日尔","尼日利亚 ","赞比亚","安哥拉","津巴布韦","马拉维","莫桑比克","博茨瓦纳","纳米比亚","南非","斯威士兰","莱索托","马达加斯加","科摩罗","毛里求斯","加拿大","美国","墨西哥","危地马拉","伯利兹","萨尔瓦多","洪都拉斯","尼加拉瓜","哥斯达黎加","巴拿马","巴哈马","古巴","牙买加","海地","多米尼加","安提瓜和巴布达","圣基茨和尼维斯","多米尼克","圣卢西亚","圣文森特和格林纳丁斯","格林纳达","巴巴多斯","特立尼达和多巴哥","哥伦比亚","委内瑞拉","圭亚那","苏里南","厄瓜多尔","秘鲁","玻利维亚","巴西","智利","阿根廷","乌拉圭","巴拉圭","澳大利亚","新西兰","帕劳","密克罗尼西亚联邦","马绍尔群岛","基里巴斯","瑙鲁","巴布亚新几内亚","所罗门群岛","瓦努阿图","斐济","图瓦卢","萨摩亚","汤加","库克群岛","纽埃"};

    //目前共34个省
    static String[] provinceArray = {"河北","山西","黑龙江","吉林","辽宁","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","海南","四川","贵州","云南","陕西","甘肃","青海","台湾","内蒙古","广西","西藏","宁夏","新疆","北京","天津","上海","重庆","香港","澳门"};

    /**
     * 功能：随机产生姓氏
     *
     * @return
     */
    public static String getFamilyName() {
        String str = "";
        int randNum = new Random().nextInt(2) + 1;
        int strLen = randNum == 1 ? familyName1.length() : familyName2.length();
        int index = new Random().nextInt(strLen);
        if (randNum == 1) {
            str = String.valueOf(familyName1.charAt(index));
        } else {
            str = (index & 1) == 0 ? familyName2.substring(index, index + 2) :
                    familyName2.substring(index - 1, index + 1);
        }
        return str;
    }

    /**
     * 随机给出国家
     * @return
     */
    public static String getProvince() {
        return countryArray[getNum(0, 196)];
    }

    /**
     * 随机给出省份
     * @return
     */
    public static String getCountry() {
        return provinceArray[getNum(0, 196)];
    }

    /**
     * 功能：随机产生性别
     *
     * @return
     */
    public static String getSex() {
        int randNum = new Random().nextInt(2) + 1;
        return randNum == 1 ? "男" : "女";
    }

    /**
     * 功能：传入性别参数，依据性别产生名字
     *
     * @param sex
     * @return
     */
    public static String[] getNameAndSex(String sex) {
        String[] nameSex = new String[2];
        int randNum = new Random().nextInt(2) + 1;
        int strLen = sex.equals("男") ? boyName.length() : girlName.length();
        int index = (randNum & 1) == 0 ? new Random().nextInt(strLen - 1) :
                new Random().nextInt(strLen);
        nameSex[0] = sex.equals("男") ? boyName.substring(index, index + randNum) :
                girlName.substring(index, index + randNum);
        nameSex[1] = sex.equals("男") ? "男" : "女";
        return nameSex;
    }

    /**
     * 功能：随机产生18-21的整数
     *
     * @return
     */
    public static int getAge() {
        return new Random().nextInt(4) + 18;
    }

    /**
     * 随机产生begin-end之间的整数，包含二者！
     * @param begin
     * @param end
     * @return
     */
    public static int getNum(Integer begin, Integer end) {
        if(end > 0 && begin >= 0 && end > begin) {
            return new Random().nextInt(end - begin + 1) + begin;
        }
        return 0;
    }

    /**
     * 随机产生一个专业类
     * @return
     */
    public static String getMajor() {
        return majorArray[getNum(0, 89)];
    }

    public static void main(String[] args) {
        String[] name = getNameAndSex("男");
        System.out.println(getFamilyName() + name[0]);
    }
}
